1. Importa las bibliotecas necesarias y carga el conjunto de datos en un DataFrame.

In [1]:
import pandas as pd

In [3]:
data = {
 'Fecha': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05'],
 'Producto': ['A', 'B', 'A', 'C', 'B'],
 'Cantidad': [10, 15, 8, 12, 20],
 'Precio unitario': [5.99, 7.5, 6.25, 9.99, 8.75],
 'Total': [59.9, 112.5, 50, 119.88, 175]
}

df = pd.DataFrame(data)
df

        Fecha Producto  Cantidad  Precio unitario   Total
0  2022-01-01        A        10             5.99   59.90
1  2022-01-02        B        15             7.50  112.50
2  2022-01-03        A         8             6.25   50.00
3  2022-01-04        C        12             9.99  119.88
4  2022-01-05        B        20             8.75  175.00

2. Realiza una exploraci√≥n inicial de los datos para comprender su estructura y contenido.

In [8]:
df.head()

        Fecha Producto  Cantidad  Precio unitario   Total
0  2022-01-01        A        10             5.99   59.90
1  2022-01-02        B        15             7.50  112.50
2  2022-01-03        A         8             6.25   50.00
3  2022-01-04        C        12             9.99  119.88
4  2022-01-05        B        20             8.75  175.00

In [6]:
df.describe()

        Cantidad  Precio unitario       Total
count   5.000000         5.000000    5.000000
mean   13.000000         7.696000  103.456000
std     4.690416         1.689165   50.558765
min     8.000000         5.990000   50.000000
25%    10.000000         6.250000   59.900000
50%    12.000000         7.500000  112.500000
75%    15.000000         8.750000  119.880000
max    20.000000         9.990000  175.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Fecha            5 non-null      object
 1   Producto         5 non-null      object
 2   Cantidad         5 non-null      int64
 3   Precio unitario  5 non-null      float64
 4   Total            5 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 332.0+ bytes

In [12]:
print(df.corr())

                 Cantidad  Precio unitario     Total
Cantidad         1.000000         0.537683  0.949243
Precio unitario  0.537683         1.000000  0.769639
Total            0.949243         0.769639  1.000000

C:\Users\tarda\AppData\Local\Temp\ipykernel_13304\4212406737.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(df.corr())

3. Limpia y preprocesa los datos para eliminar cualquier problema o inconsistencia.

In [18]:
df_filled = df.fillna(df.mean())

C:\Users\tarda\AppData\Local\Temp\ipykernel_13304\1303714736.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_filled = df.fillna(df.mean())

        Fecha Producto  Cantidad  Precio unitario   Total
0  2022-01-01        A        10             5.99   59.90
1  2022-01-02        B        15             7.50  112.50
2  2022-01-03        A         8             6.25   50.00
3  2022-01-04        C        12             9.99  119.88
4  2022-01-05        B        20             8.75  175.00

In [20]:
df_cleaned = df_filled.drop_duplicates()

In [22]:
df_cleaned["Fecha"] = pd.to_datetime(df_cleaned["Fecha"])
df_cleaned["Cantidad"] = pd.to_numeric(df_cleaned["Cantidad"])
df_cleaned["Precio unitario"] = pd.to_numeric(df_cleaned["Precio unitario"])
df_cleaned["Total"] = pd.to_numeric(df_cleaned["Total"])

In [24]:
df_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Fecha            5 non-null      datetime64[ns]
 1   Producto         5 non-null      object
 2   Cantidad         5 non-null      int64
 3   Precio unitario  5 non-null      float64
 4   Total            5 non-null      float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(1)
memory usage: 240.0+ bytes